nboutin/stm32f_disco_blinky/blinky_cmake/source/Core/Inc/stm32f401C_disco_board_define.h
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f4xx_hal.h"

#define CS_I2C_SPI_Pin                 GPIO_PIN_3
#define CS_I2C_SPI_GPIO_Port           GPIOE
#define PC14_OSC32_IN_Pin              GPIO_PIN_14
#define PC14_OSC32_IN_GPIO_Port        GPIOC
#define PC15_OSC32_OUT_Pin             GPIO_PIN_15
#define PC15_OSC32_OUT_GPIO_Port       GPIOC
#define PH0_OSC_IN_Pin                 GPIO_PIN_0
#define PH0_OSC_IN_GPIO_Port           GPIOH
#define PH1_OSC_OUT_Pin                GPIO_PIN_1
#define PH1_OSC_OUT_GPIO_Port          GPIOH
#define OTG_FS_PowerSwitchOn_Pin       GPIO_PIN_0
#define OTG_FS_PowerSwitchOn_GPIO_Port GPIOC
#define PDM_OUT_Pin                    GPIO_PIN_3
#define PDM_OUT_GPIO_Port              GPIOC
#define B1_Pin                         GPIO_PIN_0
#define B1_GPIO_Port                   GPIOA
#define I2S3_WS_Pin                    GPIO_PIN_4
#define I2S3_WS_GPIO_Port              GPIOA
#define SPI1_SCK_Pin                   GPIO_PIN_5
#define SPI1_SCK_GPIO_Port             GPIOA
#define SPI1_MISO_Pin                  GPIO_PIN_6
#define SPI1_MISO_GPIO_Port            GPIOA
#define SPI1_MISOA7_Pin                GPIO_PIN_7
#define SPI1_MISOA7_GPIO_Port          GPIOA
#define CLK_IN_Pin                     GPIO_PIN_10
#define CLK_IN_GPIO_Port               GPIOB
#define LD4_Pin                        GPIO_PIN_12
#define LD4_GPIO_Port                  GPIOD
#define LD3_Pin                        GPIO_PIN_13
#define LD3_GPIO_Port                  GPIOD
#define LD5_Pin                        GPIO_PIN_14
#define LD5_GPIO_Port                  GPIOD
#define LD6_Pin                        GPIO_PIN_15
#define LD6_GPIO_Port                  GPIOD
#define I2S3_MCK_Pin                   GPIO_PIN_7
#define I2S3_MCK_GPIO_Port             GPIOC
#define VBUS_FS_Pin                    GPIO_PIN_9
#define VBUS_FS_GPIO_Port              GPIOA
#define OTG_FS_ID_Pin                  GPIO_PIN_10
#define OTG_FS_ID_GPIO_Port            GPIOA
#define OTG_FS_DM_Pin                  GPIO_PIN_11
#define OTG_FS_DM_GPIO_Port            GPIOA
#define OTG_FS_DP_Pin                  GPIO_PIN_12
#define OTG_FS_DP_GPIO_Port            GPIOA
#define SWDIO_Pin                      GPIO_PIN_13
#define SWDIO_GPIO_Port                GPIOA
#define SWCLK_Pin                      GPIO_PIN_14
#define SWCLK_GPIO_Port                GPIOA
#define I2S3_SCK_Pin                   GPIO_PIN_10
#define I2S3_SCK_GPIO_Port             GPIOC
#define I2S3_SD_Pin                    GPIO_PIN_12
#define I2S3_SD_GPIO_Port              GPIOC
#define Audio_RST_Pin                  GPIO_PIN_4
#define Audio_RST_GPIO_Port            GPIOD
#define OTG_FS_OverCurrent_Pin         GPIO_PIN_5
#define OTG_FS_OverCurrent_GPIO_Port   GPIOD
#define SWO_Pin                        GPIO_PIN_3
#define SWO_GPIO_Port                  GPIOB
#define Audio_SCL_Pin                  GPIO_PIN_6
#define Audio_SCL_GPIO_Port            GPIOB
#define Audio_SDA_Pin                  GPIO_PIN_9
#define Audio_SDA_GPIO_Port            GPIOB
#define MEMS_INT2_Pin                  GPIO_PIN_1
#define MEMS_INT2_GPIO_Port            GPIOE

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
